rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
void CuePointTimeGet(size_t index, TAPETIME* tapeTime)
{
    memset(tapeTime, 0, sizeof(TAPETIME));

    if (index < MAX_CUE_POINTS)
    {
        int cuePosition = g_sysData.cuePoint[index].ipos;

        PositionToTapeTime(cuePosition, tapeTime);

        tapeTime->flags = (cuePosition < 0) ? 0 : F_PLUS;
    }
}

/*****************************************************************************
 * Test cue point status flags
 *****************************************************************************/

Bool IsCuePointFlags(size_t index, uint32_t flags)
{
    Bool status = FALSE;

    if (index < MAX_CUE_POINTS)
    {
        uint32_t key = Hwi_disable();

        status = g_sysData.cuePoint[index].flags & flags;

        Hwi_restore(key);
    }

    return status;
}

//*****************************************************************************
// Cue up a locate request to the locator. The cue point index is specified
// in param1. Cue point 65 is single point for cue/search buttons on machine.
//*****************************************************************************

Bool LocateSearch(size_t cuePointIndex, uint32_t cue_flags)
{
    LocateMessage msgLocate;

    if (cuePointIndex >= MAX_CUE_POINTS)
        return FALSE;

    /* Make sure the memory location has a cue point stored */
    if (!(g_sysData.cuePoint[cuePointIndex].flags & CF_ACTIVE))
        return FALSE;

    msgLocate.command = LOCATE_SEARCH;
    msgLocate.param1  = (uint32_t)cuePointIndex;
    msgLocate.param2  = cue_flags;

    return Mailbox_post(g_mailboxLocate, &msgLocate, 1000);
}

Bool LocateLoop(uint32_t cue_flags)
{
    LocateMessage msgLocate;

    /* Make sure both the mark in/out points have been set */
    if (!IsCuePointFlags(CUE_POINT_MARK_IN, CF_ACTIVE))
        return FALSE;

    if (!IsCuePointFlags(CUE_POINT_MARK_OUT, CF_ACTIVE))
        return FALSE;

    msgLocate.command = LOCATE_LOOP;
    msgLocate.param1  = CUE_POINT_MARK_IN;
    msgLocate.param2  = cue_flags;

    return Mailbox_post(g_mailboxLocate, &msgLocate, 1000);
}

//*****************************************************************************
// Cancel a locate request in process or check the status to see if the
// locator is searching and/or looping.
//*****************************************************************************

Bool LocateCancel(void)
{
    uint32_t key = Hwi_disable();
    g_sysData.searchCancel = TRUE;
    Hwi_restore(key);
    return TRUE;
}

Bool IsLocating(void)
{
    if (g_sysData.searching)
        return TRUE;

    if (g_sysData.autoLoop)
        return TRUE;

    return FALSE;
}

Bool IsLocatorSearching(void)
{
    return g_sysData.searching;
}

Bool IsLocatorAutoLoop(void)
{
    return g_sysData.autoLoop;
}

Bool IsLocatorAutoPunch(void)
{
    return g_sysData.autoPunch;
}

//*****************************************************************************
// Test to see if transport is out of tape or in thread mode.
//*****************************************************************************

Bool IsTransportHaltMode(void)
{
    uint32_t mode = (g_sysData.transportMode & MODE_MASK);

    /* Abort if transport halted, must be tape out? */
    if ((mode == MODE_HALT) || (mode == MODE_THREAD))
        return TRUE;

    return FALSE;
}

//*****************************************************************************
// Position reader/display task. This function reads the tape roller
// quadrature encoder and stores the current position data. The 7-segement
// tape position display is also updated via the task so the current tape
// position is always being shown on the machine's display on the transport.
//*****************************************************************************

Void LocateTaskFxn(UArg arg0, UArg arg1)
{
    Bool     cancel;
    Bool     done;
    Bool     looping;
    int32_t  dir;
    int32_t  cue_from;
    int32_t  out_dist;
	int32_t  cue_dist;
	int32_t  abs_dist;
    size_t   cue_index;
    uint32_t cue_flags;
	uint32_t shuttle_vel;
    uint32_t key;
    LocateState state;
    LocateMessage msg;

    /* Get current transport mode & speed from DTC */
    Transport_GetMode(&g_sysData.transportMode, &g_sysData.tapeSpeed);

    /* Clear SEARCHING_OUT status i/o pin */
    GPIO_write(Board_SEARCHING, PIN_HIGH);

    /* Set home cue point memory to zero */
    CuePointSet(CUE_POINT_HOME, 0, CF_ACTIVE);

    /* Initialize LOC-0 to zero */
    CuePointSet(g_sysData.cueIndex, 0, CF_ACTIVE);

    g_sysData.searchCancel = false;             /* true if search canceling   */
    g_sysData.searching    = false;             /* true if search in progress */
    g_sysData.autoLoop     = false;             /* true if loop mode running  */
    g_sysData.autoPunch    = false;

    /*
     * ENTER THE MAIN LOCATOR SEARCH LOOP!
     */

    while(TRUE)
    {
        /* Send TCP state change notification */
        Event_post(g_eventTransport, Event_Id_00);

        /* Wait for a locate request */
        Mailbox_pend(g_mailboxLocate, &msg, BIOS_WAIT_FOREVER);

        /* Discard locate request if in halt mode */
        if (IsTransportHaltMode())
            continue;

        looping = FALSE;

        /* Only look for search requests initially */
        if (msg.command == LOCATE_LOOP)
        {
            cue_index = CUE_POINT_MARK_IN;
            cue_flags = msg.param2;
            looping = TRUE;
#if (TTY_DEBUG_MSGS > 0)
            CLI_printf("LOOP COMMAND!\n");
#endif
        }
        else if (msg.command == LOCATE_SEARCH)
        {
            /* Get the cue point memory index. The cue point table is arranged
             * with 64 memory positions from 0-63. Memory location 64 is reserved
             * for the single point cue/search buttons on the machine timer/roller.
             */
            cue_index = (size_t)msg.param1;
            cue_flags = msg.param2;
#if (TTY_DEBUG_MSGS > 0)
            CLI_printf("SEARCH COMMAND!\n");
#endif
        }
        else
        {
#if (TTY_DEBUG_MSGS > 0)
            CLI_printf("BAD SEARCH COMMAND!\n");
#endif
            /* Unknown command */
            continue;
        }

        if (cue_index >= MAX_CUE_POINTS)
        {
#if (TTY_DEBUG_MSGS > 0)
            CLI_printf("INVALID CUE INDEX %u\n", cue_index);
#endif
            continue;
        }

