rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
                /* Fall through to next velocity check state */

			case STATE_BRAKE_VELOCITY:

			    /* Wait for velocity to drop to 15 or below */
                //CLI_printf("d=%d, f=%d, t=%u, v=%u\n", cue_dist, cue_from, (uint32_t)time, (uint32_t)velocity);

			    if (velocity > 40.0f)
			        break;
#if (TTY_DEBUG_MSGS > 0)
			    CLI_printf("BEGIN SLOW SHUTTLE d=%d, t=%d, v=%u\n", cue_dist, (int32_t)time, (uint32_t)velocity);
#endif
                /* Begin low speed shuttle */
                if (dir == DIR_FWD)
                    Transport_Fwd(SHUTTLE_SLOW_VEL, M_NOSLOW);
                else
                    Transport_Rew(SHUTTLE_SLOW_VEL, M_NOSLOW);

                /* Next look for zero cross */
                state = STATE_ZERO_CROSS;

                /* Fall through... */

            case STATE_ZERO_CROSS:

                /* ZERO CROSS - check taking direction into account */

                //CLI_printf("d=%d, f=%d, t=%u, v=%u\n", cue_dist, cue_from, (uint32_t)time, (uint32_t)velocity);

                /* Check for overshoot! */
                if (dir == DIR_FWD)
                {
                    if (cue_from < cue_dist)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("OVERSHOOT FWD: %d, %d\n", cue_dist, cue_from);
#endif
                        g_sysData.searchProgress = 100;

                        Transport_Stop();

                        if (looping)
                        {
                            state = STATE_BEGIN_LOOP;
                            break;
                        }
                        done = TRUE;
                        break;
                    }
                }
                else
                {
                    if (cue_from > cue_dist)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("OVERSHOOT REW: %d, %d\n", cue_dist, cue_from);
#endif
                        g_sysData.searchProgress = 100;

                        Transport_Stop();

                        if (looping)
                        {
                            state = STATE_BEGIN_LOOP;
                            break;
                        }
                        done = TRUE;
                        break;
                    }
                }

                if (time < 20.0f)
                {
                    g_sysData.searchProgress = 100;
                    Transport_Stop();
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("ZERO CROSSED cue=%d, abs=%d\n", cue_dist, abs_dist);
#endif
                    if (looping)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("*** AUTO-LOOPING ***\n");
#endif
                        state = STATE_BEGIN_LOOP;
                        break;
                    }

                    done = TRUE;
                }
                break;

            case STATE_BEGIN_LOOP:

                g_sysData.searching = FALSE;

                if (cue_flags & CF_AUTO_REC)
                    Transport_Play(M_RECORD);
                else
                    Transport_Play(0);

#if (TTY_DEBUG_MSGS > 0)
                CLI_printf("BEGIN LOOP MODE\n");
#endif
                /* Next look for zero cross */
                state = STATE_MARK_OUT;
                break;

            case STATE_MARK_OUT:

                /* Look for tape position to reach/pass mark-out point */

                out_dist = g_sysData.cuePoint[CUE_POINT_MARK_OUT].ipos - g_sysData.tapePosition;

                /* d = v * t */
                /* t = d/v */
                mark = fabs((float)out_dist) / velocity;

                //CLI_printf("MARK-OUT pos=%d, out=%f\n", g_sysData.tapePosition, mark);

                if (mark < 10.0f)
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("MARK-OUT REACHED pos=%d, out=%f\n", g_sysData.tapePosition, mark);
#endif
                    state = STATE_LOOP;
                    break;
                }
                break;

            case STATE_LOOP:
                /* Queue up the locate request again and loop again */
                cue_flags |=  CF_AUTO_PLAY;
                state = STATE_START_STATE;
                continue;

            default:
#if (TTY_DEBUG_MSGS > 0)
                CLI_printf("*** INVALID STATE %d ***\n", state);
#endif
			    /* invalid state! */
			    done = TRUE;
			    break;
			}

	        /* Send TCP state change notification */
	        //Event_post(g_eventTransport, Event_Id_00);

            if (done || g_sysData.searchCancel)
            {
#if (TTY_DEBUG_MSGS > 0)
                if (done)
                    CLI_printf("*** SEARCH DONE STATE 1 ***\n");

                if (g_sysData.searchCancel)
                    CLI_printf("*** SEARCH CANCELED STATE 1 ***\n");
#endif
                break;
            }

			/* Check for a new locate command. It's possible the user may have requested
			 * a new locate cue point while a locate command was already in progress.
			 * If so, we cancel the current locate request and reset to start searching
			 * at the new cue point requested.
			 */
#if 0
	        if (Mailbox_getNumPendingMsgs(g_mailboxLocate) > 0)
	        {
	            done = cancel = TRUE;
	            looping = FALSE;
	            break;
	        }
#else
	        if (Mailbox_pend(g_mailboxLocate, &msg, 1))
	        {
                if (msg.command == LOCATE_SEARCH)
	            {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("*** NEW SEARCH REQUESTED ***\n");
#endif
                    cancel = looping = FALSE;

                    /* New search requested! */

                    cue_index = (size_t)msg.param1;
                    cue_flags = msg.param2;

                    if (cue_index >= MAX_CUE_POINTS)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("*** INVALID CUE INDEX %d ***\n", cue_index);
#endif
                        break;
                    }

                    /* Is the cue point is active? */
                    if (g_sysData.cuePoint[cue_index].flags == 0)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("*** CUE POINT %d IS NOT ACTIVE! ***\n", cue_index);
#endif
                        break;
                    }

                    /* Clear the global search cancel flag */
                    key = Hwi_disable();
                    g_sysData.searching = TRUE;
                    g_sysData.autoLoop  = FALSE;
                    //g_sysData.searchCancel = FALSE;
                    g_sysData.searchProgress = 0;
                    Hwi_restore(key);

                    /* Set SEARCHING_OUT status i/o pin */
                    GPIO_write(Board_SEARCHING, PIN_LOW);

                    /* If user cue memory, turn on the button LED */
                    if (cue_index < USER_CUE_POINTS)
                        SetLocateButtonLED(cue_index);

