rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
                    /* Set transport to STOP mode initially */
                    Transport_Stop();

                    /* Save cue from distance */
                    cue_from = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

                    if (!cue_from)
                        cue_from = 1;

                    state = STATE_START_STATE;
	            }
	        }
#endif
	        /* Abort if transport halted, must be tape out? */
            if (IsTransportHaltMode())
            {
#if (TTY_DEBUG_MSGS > 0)
                CLI_printf("*** TRANSPORT HALT STATE 2 ***\n");
#endif
                done = cancel = TRUE;
                break;
            }

            /* Check for cancel search request */
            cancel = g_sysData.searchCancel;

	        /* Exit if user search cancel */
            if (done || cancel)
            {
#if (TTY_DEBUG_MSGS > 0)
                if (cancel)
                    CLI_printf("*** USER SEARCH CANCEL ***\n");
                if (done)
                    CLI_printf("*** SEARCH DONE ***\n");
#endif
                done = TRUE;
                break;
            }

	    } while (!done);    /* END OF CUE POINT SEARCH LOOP */

#if (TTY_DEBUG_MSGS > 0)
	    CLI_printf("** SEARCHING COMPLETE **\n");
#endif
        /* Set SEARCHING_OUT status i/o pin */
        GPIO_write(Board_SEARCHING, PIN_HIGH);

        /* Clear the search in progress flag */
        key = Hwi_disable();
        g_sysData.searching = FALSE;
        g_sysData.autoLoop  = FALSE;
        //g_sysData.searchCancel = FALSE;
        Hwi_restore(key);

        /* Send STOP button pulse to stop transport. If the
         * user canceled the search, then don't stop or
         * auto-play and just exit the loop allowing the
         * machine to run in it's current mode. If the
         * locate completed, we stop and enter auto play
         * if the auto play/rec cue flag specified.
         */

	    if (!cancel)
	    {
	        Transport_Stop();

            if (!looping)
            {
                if (cue_flags & CF_AUTO_PLAY)
                {
                    if (cue_flags & CF_AUTO_REC)
                        Transport_Play(M_RECORD);
                    else
                        Transport_Play(0);
                }
            }
	    }

	    g_sysData.searchCancel = FALSE;

#if (TTY_DEBUG_MSGS > 0)
	    CLI_prompt();
#endif

    } /* MAIN OUTER LOOP, BACK TO QUEUE WAIT FOR NEXT LOCATE REQUEST */
}


/*****************************************************************************
 * HELPER FUNCTIONS
 *****************************************************************************/

//*****************************************************************************
// Pulse and I/O line LOW for the specified ms duration. The following
// gpio lines are used to control the transport directly. Index should
// be one of the following for the transport control buttons:
//
//   Board_STOP_N
//   Board_PLAY_N
//   Board_FWD_N
//   Board_REW_N
//
//*****************************************************************************

#if 0
#define BUTTON_PULSE    50

void GPIOPulseLow(uint32_t index, uint32_t duration)
{
    /* Set the i/o pin to low state */
    GPIO_write(index, PIN_LOW);
    /* Sleep for pulse duration */
    Task_sleep(duration);
    /* Return i/o pin to high state */
    GPIO_write(index, PIN_HIGH);
}
#endif

/* End-Of-File */
